Revit 2024 API
BuiltInFailures.FamilyFailures.CannotCutRefPlane Property
 Can't cut reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCutRefPlane { get; }
Visual Basic
Public Shared ReadOnly Property CannotCutRefPlane As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCutRefPlane {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace